{"functions":{"generate":"from random import randrange as r\ndef g(a, b):\n\twhile b: a, b = b, a % b\n\treturn a\na = b = 0\nwhile g(a, b) != 1 or (a % 6) * (b % 6) != 0: a, b = r(2097152, 16777216), r(2097152, 16777216)\na, b = oct(a), oct(b)\nt = ['aabb', 'abab', 'abba', 'baab', 'baba', 'bbaa']\nt1, t2 = r(0, 6), r(0, 6)\ns = list(f'{t[t1]}-{t[t2]}-{t[-t1 - 1]}-{t[-t2 - 1]}')\ni = j = 2\nfor k in range(19):\n\tif s[k] == 'a':\n\t\ts[k] = a[i]\n\t\ti += 1\n\tif s[k] == 'b':\n\t\ts[k] = hex(int(b[j]) + 8)[2]\n\t\tj += 1\nEXEC_OUTPUT = ''.join(s)","verify":"EXEC_OUTPUT = False\ns = str(EXEC_INPUT['string'])\nif len(s) == 19 and s[4::5] == '---':\n\tt = ['aabb', 'abab', 'abba', 'baab', 'baba', 'bbaa']\n\ta = b = 0\n\tp = []\n\tfor i in s.split('-'):\n\t\tq = ''\n\t\ttry:\n\t\t\tfor c in i:\n\t\t\t\tc = int(c, 16)\n\t\t\t\tif c >= 8:\n\t\t\t\t\tq += 'b'\n\t\t\t\t\tb *= 8\n\t\t\t\t\tb += c - 8\n\t\t\t\telse:\n\t\t\t\t\tq += 'a'\n\t\t\t\t\ta *= 8\n\t\t\t\t\ta += c\n\t\t\tp.append(t.index(q))\n\t\texcept: break\n\tif len(p) == 4 and p[0] + p[2] == 5 and p[1] + p[3] == 5 and (a % 6) * (b % 6) == 0:\n\t\twhile b: a, b = b, a % b\n\t\tEXEC_OUTPUT = a == 1","mfa":"from random import sample as c\nr, R = range(4), range(10)\no = '☺☻♥♦♣♠♪♫'\nx = list(zip(c(o, 4), c(R, 4)))\ndef g():\n\ta = c(R, 4)\n\treturn ' + '.join(f'{a[i]}{x[i][0]}' for i in r) + ' = ' + str(sum(a[i] * x[i][1] for i in r))\nEXEC_OUTPUT = (f'''__**DiscAuthing Verification Request**__\n\nHello, xX_D4RK_L0RD_Xx.\n\nA log-in attempt for *U-Mail Electronic Mail System* has just been received. If you did not initiate this request, please change your password and ignore this message. To verify that this account activity was you, use the code below. It will expire in fifteen minutes.\n\n```\n{chr(10).join(g() for i in r)}\n{x[0][0]}={x[0][1]}\n```\n\nYour code is `{''.join(i[0] for i in x)}`.''', ''.join(str(i[1]) for i in x))"},"branches":{"tutorial":{"steps":[{"route":"/pentamerous","link":{"name":"Pigpen","link":"https://cdn.discordapp.com/attachments/461633326529118228/865245193497346048/ARG404A1P2.png","type":"image"}},{"route":"/clandestine","link":{"name":"Ottendorf","text":"Punctuation are characters too.\n\n[Note: It seems that in my own enthusiasm, I overestimated your own devotion to toiling through such tedious training ciphers. I too have learned a lesson today; this puzzle has been modified to reduce the number of unique codes. The previous document has also been slightly modified.]","link":"https://docs.google.com/document/d/e/2PACX-1vRxnokKIEZBleapGlSQlMojkGbzftYDRYDxTc4tiwLM5oFY1EMXVQ1VjthNoEUqJ3JfI8n9qV6cL1gL/pub?embedded=true","type":"embed"}},{"route":"/commencement","link":{"name":"Math Class","text":"Congratulations on making it this far; your training is almost complete. You have successfully proven your worth, and as such I will no longer continue to bother you with such menial trifles. We no longer have the time to spare.\n\nAs should be clear, the submission architecture on this website is not private. However, it will be crucial to receive communication from you as we begin conducting our investigation. As such, I have implanted small submission boxes in various locations that should be obscured from the prying eyes of the Dean. However, as I am not yet certain of their security, I need you to submit something inconspicuous just in case the message is intercepted.\n\nFor the sake of remaining in the realm of relevancy, I recommend that you study conversion between numerical bases such as binary and hexidecimal. You will likely find it useful, as ASCII characters are often encoded with such numerals. For example, the letter \"H\" may be encoded as any of the following: 72 (base 10), 0x48 or 48 (base 16), 0b01001000 or 1001000 (base 2).\n\nOnce you're ready, submit the binary representation of the decimal number 180 in the box below. Exclude the \"0b\" prefix, and add leading zeroes if necessary such that your answer contains 8 digits."},"input":{"inputs":[{"type":"text","placeholder":"Answer here","required":"required"}]}},{"route":"/commencement","method":"POST","progress":2,"answer":"10110100"},{"route":"/commencement/<string:arg_id>","generated":true,"link":{"name":"Math Class (cont.)","text":"I require one more submission from you to complete my testing of the system. Please convert the hexidecimal number 1 into base 10."},"input":{"inputs":[{"type":"text","placeholder":"Answer here","required":"required"}]}},{"route":"/commencement/<string:arg_id>","generated":true,"method":"POST","answer":"if you see this you're cheating","progress":4,"timer":{"text":"I must apologize. The directions on the previous page were dishonest, and you have been manipulated into submitting an incorrect answer to the system. As such, you have been locked out of this page. Take care when communicating in the future, as poorly thought-out messages may result in costly delays. Let this also be a demonstration that things may not always be as simple as they appear at first glance. Do not worry about re-completing this assignment. Your training is finished; you have passed all the tests. Keep an eye out on the class page for further directions at the start of Week 5. I look forward to working with you, agent.","time":999999999},"end":true}]},"judgement":{"steps":[{"route":"/judgement","link":{"name":"Judgement","text":"Congratulations. The diligence and skill you have demonstrated while completing your assignments has proved you to be a valuable asset to our mission of uncovering the secrets of UniversityTWOW. I look forward to working with you, agent."}}]},"lb":{"steps":[{"route":"/ARG404/0","requisites":["judgement"],"link":{"name":"Initiation","text":"Good morning, agent. I've got a critical task laid out for you today. We've recently received communication from a field operative belonging to one of our partner organizations. They've been undercover for quite some time now, and we believe they have left behind a hidden message somewhere. As this information is likely sensitive, however, its location remains a mystery. I've granted you the security clearance necessary to view the latest clue which has been sent to us; I have reason to believe that the whereabouts of the operative's secret information are encoded within these newspaper clippings. Your task is to decrypt this hint, travel to the specified location, and retrieve the message. Do note that it will likely be hidden or encrypted, especially if it is in a public place; it is up to you safely extract the text. Submit your findings below.","link":"https://cdn.discordapp.com/attachments/463454211791912980/873402867044737034/0-0.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Message","required":"required"}]}},{"route":"/ARG404/0","method":"POST","answer":"undead","progress":0,"timer":{"time":300,"text":"I know for certain that this is not the field operative's message. I lack the time to spare for your acts of sheer folly, agent. Do not let this happen again."}},{"route":"/undead/<string:arg_id>","generated":true,"link":{"name":"Contact","text":"Aha! Good work, agent. Your delivery has provided us with crucial information. We've gathered that the operative has stationed themself undercover and is ready to be contacted. As such, we will be sending you out into the field to meet with them. Though we've been able to narrow down their coordinates to a few candidate locations, we have failed to precisely pinpoint their whereabouts. Thanks to the message you brought us, however, we know that they are hiding somewhere among the undead. Something is lurking in the shadows, agent, and you'll have to dig deep to get to the bottom of this. It's up to you to unearth this dirty secret and bring it to light. Investigate the candidate locations provided below to find the agent; you will know them when you see them. You will require access to a computer to complete this task. Furthermore, ensure that you enable your audio systems. Good luck on your journeys, and I hope that we meet again.","link":"https://drive.google.com/drive/folders/1hiwPFRK6c6bkMbA46dl_Ne-3owQ8YfwW?usp=sharing","type":"link"}},{"route":"/sans/<string:arg_id>","generated":true,"link":{"name":"Sans's Message","link":"https://cdn.discordapp.com/attachments/463454211791912980/867843861030895676/0-2.mp4","type":"video"}},{"route":"/multiverse-anomaly","link":{"name":"Multiverse Anomaly","text":"Welcome back, agent. We've been able to connect the information that you've discovered with an old, unsolved case dating back a few years. To be more precise, we have identified a pair of anomalous sightings which took place in June of 2019. Our multiversal radar machine managed to pick up a few readings, but they are rather obfuscated. We believe that these snapshots capture the monster responsible for the incident. There are several such photographs of the creature available, but something about these ones contradicts with what we know. Your task is to identify where these images come from so that we can study them with greater context. It may not be so easy to spot these anomalies, so be sure to look very closely at any images which you come across. Once again, submit your findings in the space below.","link":"https://cdn.discordapp.com/attachments/463454211791912980/869456291976859688/0-3.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Message ID","pattern":"||d{17,}","required":"required"},{"type":"text","placeholder":"Message ID","pattern":"||d{17,}","required":"required"}],"type":"sorted"}},{"route":"/multiverse-anomaly","method":"POST","answer":"585298068308492298-587400629387919361","progress":4,"timer":{"time":300,"text":"Hmm, it seems that the images which you have provided do not match up with ours. The readings we have picked up should clearly resemble something within your picture. It would behoove you to be more cautious."}},{"route":"/ARG404/0/fin","link":{"name":"Debriefing","text":"Your work is greatly appreciated, agent. With your help, we have finally managed to close the book on this incident. As you deserve to know what has been discovered, let me briefly explain the tale to you.\n\nAbout two and a half years ago, a freakish monster known as 96 LB wreaked havoc on the city, killing about 73 unfortunate individuals and destroying multiple buildings in only one night. I'm sure this name rings a bell, so the next tidbit may surprise you: 96 LB died that night. Though the one survivor of this incident claimed otherwise, the corpse was discovered and identified by the police a few days later.\n\nHowever, that's not the end of the story. The two anomalous sightings you identified seemingly threw a wrench in everything we knew about this case. After all, one photograph was taken days after 96 LB's alleged death. Clearly, we did not have the full picture, and it was not until our correspondence with the field operative you contacted that the pieces began to fall into place.\n\n96 LB is indeed dead. That fact is undeniable. It seems, however, that one of the people he slaughtered managed to open a rift to another dimension. Through that portal, another monster passed through and has been roaming our dimension ever since. Just moments ago, we were able to determine that they have assumed the identity of 69 LB. Even more curious, however, is that they seem to be intent on continuing the idea that 96 LB never died...perhaps to hide their own mortality? The motive is still unclear.\n\nWhat is clear, however, is that the 96 LB and 69 LB you know are one and the same."},"end":true}]},"h":{"steps":[{"route":"/ARG404/1","requisites":["judgement"],"link":{"name":"Mission Briefing","link":"https://docs.google.com/document/d/e/2PACX-1vTS3Ps1b8CeomL_fD1Xtp-hsZnFipYZL0VswGT4iUh8Wn56XqkthBBwFm2Mt9Gg4KMiT1FZUiUrYdzQ/pub?embedded=true","type":"embed"}},{"route":"/door/0","link":{"name":"Black Door","text":"A black door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892213312651364/1-0.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/0","method":"POST","answer":"0725","progress":1,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/1/<string:arg_id>","generated":true,"link":{"name":"Emerald Door","text":"A emerald door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892215137157120/1-1.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/1/<string:arg_id>","method":"POST","answer":"2912","progress":3,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/2/<string:arg_id>","generated":true,"link":{"name":"Silver Door","text":"A silver door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892216777125930/1-2.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/2/<string:arg_id>","method":"POST","answer":"4578","progress":5,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/3/<string:arg_id>","generated":true,"link":{"name":"Diamond Door","text":"A diamond door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892218710712390/1-3.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/3/<string:arg_id>","method":"POST","answer":"4875","progress":7,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/4/<string:arg_id>","generated":true,"link":{"name":"Sapphire Door","text":"A sapphire door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892221046935572/1-4.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/4/<string:arg_id>","method":"POST","answer":"3478","progress":9,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/5/<string:arg_id>","generated":true,"link":{"name":"Crystal Door","text":"A crystal door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892222372335696/1-5.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/5/<string:arg_id>","method":"POST","answer":"2423","progress":11,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/6/<string:arg_id>","generated":true,"link":{"name":"Red Door","text":"A red door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892224314290186/1-6.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/6/<string:arg_id>","method":"POST","answer":"1246","progress":13,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/door/7/<string:arg_id>","generated":true,"link":{"name":"Yellow Door","text":"A yellow door blocks your way. It requires some sort of code.","link":"https://cdn.discordapp.com/attachments/463454211791912980/884892226352717844/1-7.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/door/7/<string:arg_id>","method":"POST","answer":"8573","progress":15,"timer":{"time":300,"text":"INCORRECT CODE. INTRUDER DETECTED. CRYOGENIC RAYS ACTIVATED."}},{"route":"/ARG404/1/fin","link":{"name":"June 30, 2021","text":"Finally, today I did it! After 2763 failed... \"attempts,\" I finally managed to perfect the process of cloning books! If I reveal the final result of my work from the last 22 years to the world, I will finally get the fame and recognition I deserve and never got from this good-for-nothing university! However, the process of cloning must be kept a secret from humanity, because I have much more ambitious plans for it...\n\nTo be specific, I created a clone of myself, thenamesi, and I will make it teach classes in my place so that I can use the funds I embezzled from the university to stay on vacation in the Bahamas until the day I die. However, I am not too confident yet in the intelligence of thenamesi, so I will teach TWOW101 normally and use my position at the university to keep watch on thenamesi. I am leaving MATH210 entirely to him, as I never liked that class. Hopefully nothing goes wrong...","link":"https://cdn.discordapp.com/attachments/1065676287798169620/1147152272774680576/1-8.png","type":"image"},"end":true}]},"nerd":{"steps":[{"route":"/ARG404/2","requisites":["judgement"],"link":{"name":"Notice","text":"Greetings, agent. Your new investigation will be a bit more non-traditional than the previous ones. Namely, it will require you to delve deeper in this website's infrastructure than ever before, so be sure to exercise the utmost caution in ensuring that you are not detected by the Dean. We have reason to believe that another spy, independent of our own operation, has been infiltrating the University. While we've yet to properly locate them, we have a lead in where to look. A hidden feature of this website is that when accessing any assignment, you can view its container's details by appending /container to its URL. This may unearth some details that would have been otherwise inaccessible to students. Good luck.\n\n- Mr. E"}},{"route":"/cyberspace","redirect":"https://github.com/96-LB/UniversityTWOW"},{"route":"/evasive","link":{"name":"1040","text":"Agent, what have Biscuit's notes revealed about the Dean's tax returns?","link":"https://cdn.discordapp.com/attachments/874060545194590258/874126408136400936/2-0.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Refer to the annotations."}]}},{"route":"/evasive","method":"POST","progress":2,"answer":"fraud","timer":{"time":300,"text":"Hmm, I don't think that's quite right. Perhaps Agent Biscuit left some incriminating notes on the 1040 that could help your keep your thoughts in order."}},{"route":"/ARG404/2/fin","link":{"name":"Closure","text":"Good work, agent. It's clear that Professor Biscuit, or perhaps more appropriately, Agent Biscuit of the CIA, has been spearheading the United States government's investigation of its own into UniversityTWOW's deep and darkest secrets. While I myself am not a federal agent, this is good news and bodes well for future prospects.\n\nFurthermore, the security oversights both Director Chou and Agent Biscuit left riddled all over their operation, while alarming, have allowed you to discover that Dr. 96 LB has been using UniversityTWOW as a front for tax fraud and other financially evasive purposes. Namely, he claimed the entirety of UniversityTWOW's student body from last year and this year as dependents for the purpose of tax rebates, a multimillion dollar ruse.\n\nI know this revelation might come as a shock to you as a student of the University, but I encourage you to continue in your studies regardless of the legitimacy of the University. Your degree may prove to be useful in this economy regardless."},"end":true}]},"azu":{"steps":[{"route":"/ARG404/3","requisites":["judgement"],"link":{"name":"Briefing","text":"Have a seat, agent. Your latest assignment involves some undercover fieldwork, and you may not get a chance to rest until it's complete. A certain criminal case has caught my eye—I'm sending you to investigate. Taking the place of a local defense attorney, I leave it to you to unravel the truth behind this case. Everything you will need is provided in this package: a disguise, an attorney's badge, a glass breaker, and a weapon. To make sure you are ready to proceed, demonstrate to me your best \"OBJECTION!\". Being able to shout legal hogwash is the most important part of being an attorney.\n\nDo not let me down, agent, or there will be consequences."},"input":{"inputs":[{"type":"text","placeholder":"OBJECTION!","required":"required"}]}},{"route":"/ARG404/3","method":"POST","answer":"OBJECTION!","progress":0,"timer":{"time":30,"text":"Objection overruled."}},{"route":"/inquest","link":{"link":"https://aaonline.fr/player.php?trial_id=139680","type":"embed"}},{"route":"/kangaroo","link":{"link":"https://aaonline.fr/player.php?trial_id=139681","type":"embed"}},{"route":"/confrontation","link":{"link":"https://aaonline.fr/player.php?trial_id=140413","type":"embed"}},{"route":"/denouement"},{"route":"/ARG404/3/fin","link":{"name":"Credits","text":"And thus, the case for the murder of Imun Cher came to a close. Iko L'dim received a guilty verdict, and was sentenced to life in prison. Prosecutor Azurite, on the other hand, was tried on a later date for their crimes against humanity. At the advice of attorney 96 LB and undefeated prosecutor 69 LB, Dr. Azurite chose to plead guilty. Their sentence was a verbal warning, permanent shopping duty, and onion rings for dinner. Congratulations, agent. You've done a great job.\n\n==Credits==\nWriting: Mr. E\nEffects: Mr. E\nSprites: king, Mr. E\nMystery: Mr. E\n"},"end":true}]},"dark":{"steps":[{"route":"/ARG404/4","requisites":["judgement"],"link":{"name":"Infiltration","text":"Welcome to your briefing, agent. As I'm sure you are already aware, the professor Dr. Dark went missing in action in the middle of the semester. As we have reason to suspect that he is plotting something nefarious, it is up to you to locate the doctor and stop any potential schemes. Our investigations have revealed that Dr. Dark has abandoned his laboratory, so I suggest that you infiltrate it in order to search for clues revealing his current location. Our trackers have been able to the general location of his headquarters as about halfway between Urucu and a section of the Rio Tefé. I've granted you access to our database of suspected villanious lairs below; use this to pinpoint the precise coordinates. Make sure to contact us once you've collected enough information to discover where the professor ran off to. Good luck, agent; you'll need it.","link":"https://www.google.com/maps/d/embed?mid=1BZwu0NdNACVtYdgDMxkFPpkWE98EaQT7","type":"embed"}},{"route":"/brush","link":{"name":"Hidden Lever","text":"You notice a small lever hidden inside of the bush. Do you pull it?"},"input":{"inputs":[{"type":"checkbox","value":"pull","label":"Pull the lever."}]}},{"route":"/brush","method":"POST","answer":"pull","progress":1,"timer":{"time":60,"text":"A snare trap triggers and leaves you hanging from a tree. What kind of contraption activates only when somebody doesn't pull a lever? Clearly, you're dealing with a mastermind here."},"channels":["871847467661000716","871847701405396993"],"role":"871987184415162369"},{"route":"/brush/<string:arg_id>","generated":true,"link":{"name":"Hidden Lever","text":"You pull the lever and hear a click followed by a loud creaking sound. It seems to be coming from the direction of the building. You get the feeling that you should go check it out."}},{"route":"/laptop/login","link":{"name":"Laptop","text":"You open the installed e-mail application. The computer screen reads \"Please enter your password to proceed to your U-Mail inbox.\"."},"input":{"inputs":[{"type":"password","placeholder":"Password","required":"required"}]}},{"route":"/laptop/login","method":"POST","answer":"R3V0LUT10N","progress":4,"timer":{"time":300,"text":"Whoops, that wasn't right! The computer's built-in security features activate and shut the laptop down. It looks like you'll have to wait a while for it to unlock."}},{"route":"/laptop/2fa/<string:arg_id>","generated":true,"progress":4,"link":{"name":"2-Factor Authentication","text":"Your password is accepted, but the U-Mail system requires you to undergo two-factor authentication as an additional security step. The screen reads \"Please input the code sent to your registered account ID via Discord. The code will expire in 15 minutes.\""},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/laptop/2fa/<string:arg_id>","generated":true,"method":"POST","answer":"if you see this you're cheating","progress":4,"timer-manual":{"time":300,"text":"Whoops, that wasn't right! The computer's built-in security features activate and shut the laptop down. It looks like you'll have to wait a while for it to unlock."}},{"route":"/laptop/alert/<string:arg_id>","generated":true,"requisites":["dark-phone"],"link":{"name":"Security Alert","text":"Success! You manage to break into the U-Mail account and quickly take a picture of the inbox for future reference. Though you wish to begin studying these messages immediately, a more pressing concern reaches your eyes. One of these e-mails is a security alert, notifying the account holder of new activity. You initially think to yourself that this is no problem, but then you come to a horrifying conclusion. As is usual with propietary university technology, the user interface of this system is so staggeringly bad that you cannot figure out how to dismiss the alert or delete the e-mail.\n\nAs such, you're forced to resort to Plan B. Fortunately, university systems also have terrible security, and you manage to get ahold of the database and plan to directly modify it in order to erase the security alert. It looks like it's encrypted, so you'll have to decode it, edit the data without tampering with the formatting, and re-encode it. The contents of the database are displayed below.","link":"https://docs.google.com/document/d/e/2PACX-1vTCWalYSjjL7XPE1l5eT4qAMvuVPDUkfVrmOovyYJ0he2diadT635zjxcUJZVMmSgEpu8uwAdegncxq/pub?embedded=true","type":"embed"},"input":{"inputs":[{"type":"text","placeholder":"Modified database","required":"required"}]}},{"route":"/laptop/alert/<string:arg_id>","generated":true,"method":"POST","answer":"eyJlbWFpbCI6ImRhcmsudW5pdmVyc2l0eXR3b3dAZ21haWwuY29tIiwiaW5ib3giOlsiUHVyY2hhc2UgY29uZmlybWF0aW9uIiwiQkVFUCBCT09QIEkgQU0gQSBST0JPVCIsIllvdSBtaXNzZWQgbWVzc2FnZXMgaW4gVW5pdmVyc2l0eVRXT1cgKENsYXNzIG9mIDIwMjEpIiwiWW91IG1pc3NlZCBtZXNzYWdlcyBpbiBVbml2ZXJzaXR5VFdPVyAoQ2xhc3Mgb2YgMjAyMSkiLCJZb3UgbWlzc2VkIG1lc3NhZ2VzIGluIFVuaXZlcnNpdHlUV09XIChDbGFzcyBvZiAyMDIxKSIsIk5ldyBTcHlpbmcgVGVjaG5pcXVlISExISIsIkRpc2NvcmQgQ2F0ZWdvcnkgSGFjayJdfQ==","progress":8,"timer":{"time":300,"text":"Yikes! It look like something went wrong. The system went down, and all you can do is pray that nobody notices you. It's probably best if you wait a little before trying again; be more careful next time!"}},{"route":"/laptop/u-mail/<string:arg_id>","generated":true,"link":{"name":"U-Mail Inbox","text":"You did it! The e-mail disappears from the inbox, but it's only a few seconds until the rest of them vanish as well. The U-Mail screen is replaced by an ugly error message reading \"Sorry, but this service is not available at this time. Please try again during scheduled hours.\" What kind of website only functions for a few hours a day? It's a good thing you took that screenshot—you suspect that even just a picture of the inbox will be enough to find revealing evidence. You're getting close; you can feel it. Using all the information you've gathered up until this point, as well as the leads opened up by these e-mails, can you figure out where Dr. Dark disappeared to?","link":"https://cdn.discordapp.com/attachments/463454211791912980/875503950177136650/3-u.png","type":"image"},"input":{"inputs":[{"type":"text","placeholder":"Country","required":"required"}]}},{"route":"/laptop/u-mail/<string:arg_id>","generated":true,"method":"POST","answer":"Monaco","progress":10,"timer":{"time":300,"text":"About three seconds after you send the location to Mr. E, a toast notification pops up on the laptop in front of you. Your face goes pale as you read the condescending message, berating you for your obviously incorrect report. Just as quickly as it appeared, the notification myteriously vanishes without a trace. Maybe you should take some time to think about this a little more."}},{"route":"/ARG404/4/fin","requisites":["dark-vault"],"link":{"name":"Incriminating Evidence","text":"Satisfactory work, agent. Thanks to your investiations, we were able to track down Dr. Dark's location in Monte Carlo. We dispatched a team and discovered the following receipt in his apartment, a paper trail which led us to a staggering truth. Just as we suspected, Dr. Dark had nefarious plans that, left unattended, would destroy the world. As you can see, the professor purchased Maruchan Instant Noodles, which contain palm oil. By consuming such an environmentally unfriendly product, Dr. Dark has contibuted to deforestation of rainforests and is harming the diverse ecosystem. This heinous crime must be stopped; we'll take it from here, agent.","link":"https://cdn.discordapp.com/attachments/463454211791912980/875840626996961320/3-r.png","type":"image"},"end":true}]},"dark-brb":{"steps":[{"route":"/brb","requisites":["judgement"],"link":{"name":"Big Red Button","text":"A big red button sits before you. You feel the uncontrollable desire to press it."},"input":{"inputs":[{"type":"hidden","label":"Just press the button already!"}]},"timer-manual":{"time":15,"text":"The Big Red Button did nothing. Another button arrives in 15 seconds."}},{"route":"/brb","method":"POST","answer":"if you see this you're cheating","progress":0,"timer-manual":{"time":21600,"text":"The Big Red Button blew up! You have been incapacitated and cannot press any more buttons for 6 hours."},"channels":["871847892414001222"],"role":"871987396525322250"}]},"dark-phone":{"steps":[{"route":"/phone","requisites":["judgement"],"link":{"name":"Phone","text":"You strain your eyes to read the bright screen of the flip phone in the dark vault room. It appears to be property of the university, presumably provided to the professor for professional use. Lacking a mobile plan and being disconnected from any wireless network, the device appears unable to reach the Internet or cell towers. The only installed application is DiscAuthing, a 2-factor authentication program which operates by sending direct messages through Discord. You navigate to the settings page and see an option to configure which account ID receives the message."},"input":{"inputs":[{"type":"text","placeholder":"Recipient","pattern":"||d{17,}","required":"required"}]}},{"route":"/phone","method":"POST","progress":0,"answer":"if you see this you're cheating","messages":["Please complete the attached captcha by extracting the embedded 4-digit numerical code in order to prove that you are not a robot and complete your DiscAuthing verification request.","https://cdn.discordapp.com/attachments/463454211791912980/874004633528467516/4181.png"]},{"route":"/phone/<string:arg_id>","generated":true,"link":{"name":"DiscAuthing","text":"The application gives you a small alert. \"Please verify that you have access to the provided Discord ID by entering the 4-digit numerical code which you have just been sent.\""},"input":{"inputs":[{"type":"text","placeholder":"Code","pattern":"||d{4}","required":"required"}]}},{"route":"/phone/<string:arg_id>","generated":true,"method":"POST","progress":2,"answer":"4181","timer":{"time":300,"text":"Once you enter the code, DiscAuthing freezes and stops responding. Why are these multi-factor authentication applications always so slow and unreliable? Well, at least this gives you some time to fix your incorrect answer."}},{"route":"/phone/success/<string:arg_id>","generated":true,"link":{"name":"Success","text":"Your settings have been successfully updated."},"end":true}]},"dark-vault":{"steps":[{"route":"/vault","requisites":["dark-brb"],"link":{"name":"Vault","text":"The metal safe has an alphabetic keypad on it. It seems that you'll need to enter a password to open it up."},"input":{"inputs":[{"type":"text","placeholder":"Password","required":"required"}]}},{"route":"/vault","method":"POST","answer":"evil","progress":0,"timer":{"time":300,"text":"Bzzt! The safe lets out a quick electric jolt, causing the room to flash brightly for an instant. As you can already smell your fingertips beginning to smoke, you decide that you should take a break before trying that again."}},{"route":"/safe/<string:arg_id>","generated":true,"link":{"name":"Safe","text":"Much to your relief, the safe opens with a gentle click. Grasping inside its dark interior, your hand comes up empty...almost. The only thing within here is a small slip of paper with the following text written on it:\n\n\"O§D§c§1§O§D§E§0§M§D§U§y§O§D§Q§z§M§T§E§w§N§D§E§w§.§G§V§t§D§m§m§.§Z§C§T§z§K§M§y§E§i§n§x§P§W§q§y§K§W§n§1§9§e§c§3§l§t§b§G§-§9§8§w§o§K§n§O§0§q§k§\""},"end":true}]},"fin":{"steps":[{"route":"/ARG404/fin","requisites":["lb","h","nerd","azu","dark"],"redirect":"https://discord.gg/sqV7bsmT9R"}]}}}